<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {font-size: 18px}
.Estilo2 {
	font-size: 36px;
	font-weight: bold;
	color: #FF0000;
}
.Estilo3 {
	font-size: 36px;
	font-weight: bold;
}
.Estilo4 {font-size: 36px; }
.Estilo5 {font-size: 24px; }
-->
</style>
</head>

<body>
<form id="form1" name="form1" method="post" action="">
  <p align="center" class="Estilo2">XAMPP</p>
  <p align="left" class="Estilo1">XAMPP es un servidor  independiente de plataforma, software libre, que consiste principalmente en la  base de datos MySQL, el servidor Web Apache y los int&eacute;rpretes para lenguajes de  script: PHP y Perl. El nombre proviene del acr&oacute;nimo de X (para cualquiera de  los diferentes sistemas operativos), Apache, MySQL, PHP, Perl. El programa est&aacute;  liberado bajo la licencia GNU y act&uacute;a como un servidor Web libre, f&aacute;cil de usar  y capaz de interpretar p&aacute;ginas din&aacute;micas. Actualmente XAMPP esta disponible  para Microsoft Windows, GNU/Linux, Solaris, y MacOS X.<br />
      <strong>Entre  el software que incluye cabe destacar:</strong><br />
    Apache HTTPD 2.2.11<br />
    MySQL 5.1.33<br />
    PHP 5.2.9<br />
    OpenSSL 0.9.8i<br />
    phpMyAdmin 3.1.3.1<br />
    XAMPP Control Panel 2.5<br />
    FileZilla FTP Server 0.9.27<br />
    Mercury Mail Transport System v4.62<br />
    FileZilla FTP Server 0.9.3<br />
    Webalizer 2.01-10</p>
  <div align="left"><span class="Estilo1"><br clear="all" />
    </span>
  </div>
  <h3 align="left" class="Estilo3">Descargar XAMPP </h3>
  <p align="left" class="Estilo1">Para poder instalar el programa&nbsp;<strong>XAMPP</strong>&nbsp;en  Windows, primero tenemos que desc&aacute;rgalo de su p&aacute;gina oficial.</p>
  <h4 align="left" class="Estilo1"><strong>Paso 1</strong>:&nbsp;Ir a su  p&aacute;gina oficial de XAMPP</h4>
  <p align="left" class="Estilo1">Para descargar el programa&nbsp;<strong>XAMPP</strong>&nbsp;a  tu computadora, primero tienes que ir a su p&aacute;gina oficial y desde all&iacute; podr&aacute;s  descargar el software para su instalaci&oacute;n en Windows 10.<br />
    Entonces, lo que tienes que hacer ahora, es ir a su  p&aacute;gina oficial del programa&nbsp;<strong>XAMPP </strong>haciendo clic en este enlace&nbsp;<a href="https://www.apachefriends.org/es/index.html" target="_blank">https://www.apachefriends.org/es/index.html</a>&nbsp;y autom&aacute;ticamente en tu navegador se abrir&aacute;  una nueva pesta&ntilde;a con la p&aacute;gina oficial de&nbsp;<strong>XAMPP</strong>&nbsp;en  espa&ntilde;ol, y desde all&iacute; podr&aacute;s descargarlo el programa.</p>
  <p align="left" class="Estilo1"> </p>
  <h4 align="left" class="Estilo1"><strong>Paso 2:</strong>&nbsp;Descargar XAMPP  Gratis</h4>
  <p align="left" class="Estilo1">En su p&aacute;gina web oficial podemos ver varios  opciones de descarga, por ejemplo: este software&nbsp;<strong>XAMPP</strong>&nbsp;est&aacute;  disponible para distintas plataforma de Sistemas Operativos como  para&nbsp;Windows, Linux y Mac.<br />
    Lo que tienes que hacer aqu&iacute; es, escoger para la  plataforma Windows, porque en esta gu&iacute;a te ense&ntilde;are a c&oacute;mo instalar el  programa&nbsp;<strong>XAMPP</strong>&nbsp;en Windows 10.<br />
  <br />
    Adem&aacute;s, el programa&nbsp;<strong>XAMPP</strong>&nbsp;soporta  as&iacute; como:&nbsp;<strong>Windows 7, Windows 8.1 y Windows</strong>&nbsp;de  32 bits y de 64 bits, es decir no tendr&aacute;s ning&uacute;n problema al momento de  instalar.</p>
  <h4 align="left" class="Estilo1"><strong>Paso 3:</strong>&nbsp;Descargar XAMPP  en Google Chrome</h4>
  <p align="left" class="Estilo1">Si para descargar el programa&nbsp;<strong>XAMPP</strong>&nbsp;estas  utilizando el navegador Google Chrome, entonces al momento de hacer clic en el  bot&oacute;n&nbsp;<strong>&ldquo;XAMPP para Windows&rdquo;</strong>&nbsp;se  te abrir&aacute; una nueva pesta&ntilde;a y autom&aacute;ticamente en la parte inferior del  navegador aparecer&aacute; una barra en el cual te va indicar el proceso de descarga  del programa&nbsp;<strong>XAMPP</strong>.</p>
  <p align="left" class="Estilo1"> </p>
  <h4 align="left" class="Estilo1"><strong>Paso 4:</strong>&nbsp;Descargar XAMPP  Manualmente</h4>
  <p align="left" class="Estilo1">Existen casos, en donde la descarga no empieza  autom&aacute;ticamente, en este caso lo que tienes que hacer es lo siguiente.<br />
    Donde dice&nbsp;<em><strong>&ldquo;&iexcl;Genial!, Tu descarga deber&iacute;a  empezar autom&aacute;ticamente. Si no es as&iacute;, haz clic aqu&iacute;&rdquo;</strong></em>, tienes  que seguir lo que te indica para poder descargar el programa&nbsp;<strong>XAMPP</strong>&nbsp;manualmente  para Windows 10.<br />
    Una vez que hagas esta acci&oacute;n manualmente,  inmediatamente en la parte inferior del navegado Google Chrome aparecer&aacute; una  barra con el proceso de descarga del programa&nbsp;<strong>XAMPP</strong>.<br />
  </p>
  <h4 align="left" class="Estilo1"><strong>Paso 5:</strong>&nbsp;Comprobar la Descarga del Programa XAMPP</h4>
  <p align="left" class="Estilo1">Para poder instalar el programa&nbsp;<strong>XAMPP</strong>&nbsp;en  Windows 10, lo que tienes que haces es: ver si la descargar completo con &eacute;xito.<br />
    Esto sabr&aacute;s cuando en la barra inferior del navegador  Google Chrome aparece el indicador de descarga como finalizado.<br />
  <br />
    Si la descarga finaliz&oacute; con &eacute;xito, entonces ya  puedes instalar el programa&nbsp;<strong>XAMPP</strong>&nbsp;en Windows 10 siguiendo los pasos que  te voy a indicar a continuaci&oacute;n.</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <div align="left"><span class="Estilo1"><br clear="all" />
    </span>
  </div>
  <p align="left" class="Estilo4">INSTALACION DE XAMPP</p>
  <p align="left" class="Estilo1">Una vez  ubiquemos donde hemos descargado el XAMPP, nos colocamos con el rat&oacute;n sobre el  y pulsamos el bot&oacute;n derecho, y pulsaremos sobre la opci&oacute;n que dice:&nbsp;<strong>Ejecutar  como administrador</strong>.<br />
      <br />
  </p>
  <p align="left" class="Estilo1">El programa de  instalaci&oacute;n arrancar&aacute; y nos mostrar&aacute; la siguiente pantalla, donde el Windows  nos pregunta si queremos que el instalador de XAMPP haga cambios en el PC.  Pulsamos sobre&nbsp;<strong>Si</strong>. </p>
  <p align="left" class="Estilo1"> <br />
      <br />
    A continuaci&oacute;n  nos saldr&aacute; la siguiente pantalla.&nbsp;El Control de cuentas de usuario (UAC)  es un componente de seguridad de Windows y que permite a los usuarios realizar  tareas comunes como no administradores y como administradores pero sin tener  que cambiar de usuario, cerrar sesi&oacute;n ni utilizar Ejecutar como, pero puede que  te de errores en algunas ocasiones si no ejecutas el programa como  administrador. Si eres el &uacute;nico usuario y adem&aacute;s administrador de tu PC, puedes  desactivar el UAC, pero no te lo aconsejo, ya que sirve de recordatorio del  cuidado que debes tener al instalar programas en tu equipo.<br />
  <br />
    Pulsamos OK, para continuar<br />
  <br />
  <br />
  <br />
    Inmediatamente se nos bre la siguiente ventana y  pulsamos en la opci&oacute;n&nbsp;<strong>Next</strong>.<br />
  <br />
  <br />
  <br />
    En la siguiente  pantalla que se nos presenta podemos escoger que vamos a instalar y que no en  nuestro servidor. Podemos escoger todas las opciones como en este caso, Pulsamos  sobre el bot&oacute;n&nbsp;<strong>Next</strong>.<br />
  <br />
  <br />
  <br />
    A continuaci&oacute;n  la siguiente ventana nos sugiere donde instala el XAMPP. Aqu&iacute; debes tener en  cuenta para que estas instalando el XAMPP. Si lo vas usar para un sitio web en  producci&oacute;n, puede que consideres instalarlo en otro disco para su uso exclusivo  del espacio, adem&aacute;s en ese caso es mejor modificar luego la configuraci&oacute;n del  apache.&nbsp; En este caso lo instalaremos donde lo sugiere el programa de  instalaci&oacute;n. Pulsamos&nbsp;<strong>Next</strong>.<br />
  <br />
  <br />
  <br />
    En esta  siguiente pantalla no sindica que Bitnami nos puede proveer de instaladores de  las aplicaciones&nbsp; web Drupal, Joomla, WordPress&nbsp; y muchas otras para  XAMPP. En este caso no vamos a instalar nada, con lo que despu&eacute;s podemos ver  esta informaci&oacute;n. Desmarcamos la casilla&nbsp;<strong>Learn more about Bitnami for  XAMPP</strong>, y pulsamos sobre el bot&oacute;n&nbsp;<strong>Next</strong>.<br />
  <br />
  <br />
  <br />
    La siguiente  pantalla simplemente nos informa de que el programa de instalaci&oacute;n est&aacute;  preparado para instalar el XAMPP en el PC. Si queremos cambiar algo podemos  hacerlo ahora y pulsar el bot&oacute;n Back para hacer los cambios, sino para empezar  a instalar XAMPP con la configuraci&oacute;n que tenemos solo pulsamos sobre&nbsp;<strong>Next.</strong><br />
  <br />
  <br />
  <br />
    Nos aparece la  siguiente pantalla que nos informa el progreso de la instalaci&oacute;n.<br />
  <br />
  <br />
  <br />
    En un momento  dado el Firewall de Windows nos salta, diciendo que ha bloqueado algunas  caracter&iacute;sticas del servidor Apache de XAMPP para las redes publicas y  privadas. Aqu&iacute; simplemente debemos escoger as opciones que vamos a utilizar. Si  es en un entorno Local, o sea, una Red interna dejaremos marcada la casilla  Redes privadas, como dom&eacute;sticas&nbsp; o del trabajo. Esta es la que pone por  defecto al Firewall. Pero si el uso del servidor va a ser publico, debemos  marcas la casilla Redes p&uacute;blicas. El hacer esto expone el equipo a ataques, con  lo cual deberemos protegerlo adecuadamente. Podemos optar por ponerlo detr&aacute;s de  proxy, pero eso es otro tema. Dejemos marcada la casilla Redes privadas, para  esta instalaci&oacute;n. Pulsamos sobre el bot&oacute;n&nbsp;<strong>Permitir acceso</strong>. Ojo, el  programa de instalaci&oacute;n, no se detiene en esta pregunta, el seguir&aacute;  instalandose, ya que el que est&aacute; preguntando es el Windows.<br />
  <br />
  <br />
  <br />
  <br />
    Finalmente  aparece la siguiente pantalla que indica la finalizaci&oacute;n de la instalaci&oacute;n de  XAMPP. Si no queremos que el Control Panel del XAMPP arranque ahora, dejamos  sin marcar la casilla&nbsp;<strong>Do you want to start the Control Panel now</strong>?.  Aqu&iacute; lo marcaremos para iniciar de una vez el XAMPP, ya que hay que hacer unas  configuraciones m&aacute;s luego de instalar XAMPP. Pulsamos el bot&oacute;n&nbsp;<strong>Finish</strong>.<br />
  <br />
  </p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="left" class="Estilo1">&nbsp;</p>
  <p align="center" class="Estilo1"><a href="video10.html" target="_self" class="Estilo5">VIDEO DE COMO UTILIZARLO AQUI</a></p>
  <p align="left" class="Estilo1">&nbsp;</p>
</form>
</body>
</html>
